In [1]:
import pandas as pd

file_path = "/Users/balmukundmishra/Desktop/2025-Learning/ML-Course/Datasets/employees.csv"

df = pd.read_csv(file_path)

df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [2]:
df['Salary'] = df['Salary']*2

In [4]:
df['Salary'] = df['Salary'].apply(lambda x: x*2 )

In [5]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,389232,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,247732,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,522360,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,554820,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,404016,1.389,True,Client Services

In [6]:
df['Tax'] = df['Salary'].apply(lambda x: x * 0.3 if x > 50000 else x * 0.2)

In [8]:
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Tax
0,Douglas,Male,8/6/1993,12:42 PM,389232,6.945,True,Marketing,116769.6
1,Thomas,Male,3/31/1996,6:53 AM,247732,4.170,True,NaN,74319.6
2,Maria,Female,4/23/1993,11:17 AM,522360,11.858,False,Finance,156708.0
3,Jerry,Male,3/4/2005,1:00 PM,554820,9.340,True,Finance,166446.0
4,Larry,Male,1/24/1998,4:47 PM,404016,1.389,True,Client Services,121204.8
...,...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,529932,16.655,False,Distribution,158979.6
996,Phillip,Male,1/31/1984,6:30 AM,169568,19.675,False,Finance,50870.4
997,Russell,Male,5/20/2013,12:39 PM,387656,1.421,False,Product,116296.8
998,Larry,Male,4/20/2013,4:45 PM,242000,11.985,False,Business Development,72600.0
999,Albert,Male,5/15/2012,6:24 PM,519796,10.169,True,Sales,155938.8

In [11]:
df.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
Tax                    0
dtype: int64

In [12]:
df['First Name'].fillna(df['First Name'].mode, inplace=True)

In [13]:
df.isnull().sum()

First Name             0
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
Tax                    0
dtype: int64

In [14]:
df['Gender'].fillna(df['Gender'].median, inplace=True)

In [15]:
df.isnull().sum()

First Name            0
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
Tax                   0
dtype: int64

In [16]:
df.isnull().any(axis=0)

First Name           False
Gender               False
Start Date           False
Last Login Time      False
Salary               False
Bonus %              False
Senior Management     True
Team                  True
Tax                  False
dtype: bool

In [17]:
df.isnull().any(axis=1)

0      False
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [18]:
## lets get the data type of collumn 'Senior Management' wheather the values are int, float, or string
df['Bonus %'].dtype

dtype('float64')

In [19]:
df['Senior Management'].dtype

dtype('O')

In [20]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Tax
0,Douglas,Male,8/6/1993,12:42 PM,389232,6.945,True,Marketing,116769.6
1,Thomas,Male,3/31/1996,6:53 AM,247732,4.170,True,NaN,74319.6
2,Maria,Female,4/23/1993,11:17 AM,522360,11.858,False,Finance,156708.0
3,Jerry,Male,3/4/2005,1:00 PM,554820,9.340,True,Finance,166446.0
4,Larry,Male,1/24/1998,4:47 PM,404016,1.389,True,Client Services,121204.8

In [21]:
## lets change the datatype

df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
Tax                  float64
dtype: object

In [22]:
## Renaming collumn
df.rename(columns={'First Name': 'First_Name', 'Last Login Time': 'Last_Login_Time'}, inplace=True)

In [23]:
df.columns

Index(['First_Name', 'Gender', 'Start Date', 'Last_Login_Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team', 'Tax'],
      dtype='object')

In [24]:
df.isna().sum()

First_Name            0
Gender                0
Start Date            0
Last_Login_Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
Tax                   0
dtype: int64

In [25]:
df.isnull().sum()

First_Name            0
Gender                0
Start Date            0
Last_Login_Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
Tax                   0
dtype: int64

In [26]:
df['Senior Management'].fillna(df['Senior Management'].mode, inplace=True)

In [27]:
df.isna().sum()

First_Name            0
Gender                0
Start Date            0
Last_Login_Time       0
Salary                0
Bonus %               0
Senior Management     0
Team                 43
Tax                   0
dtype: int64

In [28]:
df['Team']

0                 Marketing
1                       NaN
2                   Finance
3                   Finance
4           Client Services
               ...
995            Distribution
996                 Finance
997                 Product
998    Business Development
999                   Sales
Name: Team, Length: 1000, dtype: object

In [29]:
df['Team'].fillna(df['Team'].mode, inplace=True)

In [30]:
df.isna().sum()

First_Name           0
Gender               0
Start Date           0
Last_Login_Time      0
Salary               0
Bonus %              0
Senior Management    0
Team                 0
Tax                  0
dtype: int64

In [31]:
df.columns

Index(['First_Name', 'Gender', 'Start Date', 'Last_Login_Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team', 'Tax'],
      dtype='object')